src/Enums/ТипыУведомленийМЭДО/ТипыУведомленийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУведомленийМЭДО</name>
  <enumValues>
    <name>ОРегистрации</name>
    <comment>documentAccepted</comment>
  </enumValues>
  <enumValues>
    <name>ОбОтказеВРегистрации</name>
    <comment>documentRefused</comment>
  </enumValues>
  <enumValues>
    <name>ОПостановкеНаКонтроль</name>
    <comment>documentSent</comment>
  </enumValues>
  <enumValues>
    <name>ОПринятииКИсполнению</name>
    <comment>executorAssigned</comment>
  </enumValues>
  <enumValues>
    <name>ОПодготовкеДоклада</name>
    <comment>reportPrepared</comment>
  </enumValues>
  <enumValues>
    <name>ОНаправленииДоклада</name>
    <comment>reportSent</comment>
  </enumValues>
  <enumValues>
    <name>ОХодеИсполнения</name>
    <comment>courseChanged</comment>
  </enumValues>
  <enumValues>
    <name>ОбОпубликовании</name>
    <comment>documentPublished</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыУведомленийМЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Строковое значение для тип уведомления, как оно будет записано в xml-сообщении уведомления. 
// Это фиксированные фразы для xml-сообщения, они не переводятся - НСтр() не нужен.
// 
// Параметры:
//  ТипУведомления - ПеречислениеСсылка.ТипыУведомленийМЭДО - Тип уведомления
// 
// Возвращаемое значение:
//  Строка - Строковое значение для типа уведомления
Функция СтроковоеЗначениеПоЗначению(ТипУведомления) Экспорт
	
	Если ТипУведомления = ОПостановкеНаКонтроль Тогда
		Возврат "Поставлен на контроль"; // documentSent
	ИначеЕсли ТипУведомления = ОРегистрации Тогда
		Возврат "Зарегистрирован"; // documentAccepted
	ИначеЕсли ТипУведомления = ОбОтказеВРегистрации Тогда
		Возврат "Отказано в регистрации"; // documentRefused
	ИначеЕсли ТипУведомления = ОПринятииКИсполнению Тогда 
		Возврат "Назначен исполнитель"; // executorAssigned
	ИначеЕсли ТипУведомления = ОПодготовкеДоклада Тогда 
		Возврат "Доклад подготовлен"; // reportPrepared
	ИначеЕсли ТипУведомления = ОНаправленииДоклада Тогда
		Возврат "Доклад направлен"; // reportSent
	ИначеЕсли ТипУведомления = ОХодеИсполнения Тогда
		Возврат "Исполнение"; // courseChanged
	ИначеЕсли ТипУведомления = ОбОпубликовании Тогда
		Возврат "Опубликование"; // documentPublished
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получить значение перечисления по строковому значению из xml-сообщения-уведомления МЭДО.
// 
// Параметры:
//  СтрокоеЗначение - Строка - Строковое значение из xml
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыУведомленийМЭДО - Соответствующее значение перечисления.
Функция ЗначениеПоСтроковомуЗначению(СтрокоеЗначение) Экспорт
	
	Если СтрокоеЗначение = "Поставлен на контроль" Тогда
		Возврат ОПостановкеНаКонтроль; // documentSent
	ИначеЕсли СтрокоеЗначение = "Зарегистрирован" Тогда
		Возврат ОРегистрации; // documentAccepted
	ИначеЕсли СтрокоеЗначение = "Отказано в регистрации" Тогда
		Возврат ОбОтказеВРегистрации; // documentRefused
	ИначеЕсли СтрокоеЗначение = "Назначен исполнитель" Тогда 
		Возврат ОПринятииКИсполнению; // executorAssigned
	ИначеЕсли СтрокоеЗначение = "Доклад подготовлен" Тогда 
		Возврат ОПодготовкеДоклада; // reportPrepared
	ИначеЕсли СтрокоеЗначение = "Доклад направлен" Тогда
		Возврат ОНаправленииДоклада; // reportSent
	ИначеЕсли СтрокоеЗначение = "Исполнение" Тогда
		Возврат ОХодеИсполнения; // courseChanged
	ИначеЕсли СтрокоеЗначение = "Опубликование" Тогда
		Возврат ОбОпубликовании; // documentPublished
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
